flameSpread_parallelPanels/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ground
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    sides
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           $internalField;
    }

    burner
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001294; //60kW  C3H8
        value           uniform (0 0 0);
    }

    "(region0_to.*)"
    {
        type            flowRateInletVelocityPyrolysisCoupled;
        phi             phi;
        nbrPhi          phiGas;
        rho             rho;     
        hocSolid        15.9e6; //Hoc for virgin material, single-wall corrugated cardboard 
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
