flameSpread_parallelPanels/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }

    "(region0_to.*)"
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    0;
        phi                 phi;
        rho                 rho;
        value               uniform 0;
    }
}

// ************************************************************************* //
