flameSpread_parallelPanels/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 0 -1)
    ( 1 0 -1)
    ( 1 4 -1)
    (-1 4 -1)
    (-1 0 1)
    ( 1 0 1)
    ( 1 4 1)
    (-1 4 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 40 20) simpleGrading (1 1 1) //10cm cells
);

edges
(
);

boundary
(
    ground0
    {
        type    wall;
        faces
        (
            (0 1 5 4)
        );
    }

    sides
    {
        type    patch;
        faces
        (
            (1 2 6 5)
            (0 3 2 1)
            (0 4 7 3)
            (6 7 4 5)
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (7 6 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
