flameSpread_parallelPanels/system/burner.setSet
faceSet burnerFace new boxToFace (-0.15 -0.0001 -0.3)(0.15 0.0001 0.3)
